class WeaponAndArmorData {
	public String[] weapon = {"ナイフ","ショートソード","メイス","ロングソード","クレイモア"};
	public int[][] weaponValue = {		/*武器リスト　武器名　武器ポイント　買値　A戦士装備可能　B戦士装備可能　C魔術師装備可能　D戦士装備可能*/
		{2,10,1,1,0,1},
		{4,40,1,1,0,1},
		{5,80,1,1,0,1},
		{6,120,1,0,0,1},
		{7,200,1,0,0,0}
	};
	
	public String[] armor = {"レザーアーマーS","レザーアーマーM","レザーアーマーL","チェインメイルS","チェインメイルM","チェインメイルL",
				"フルプレートメイルM","フルプレートメイルL","タバードS","タバードM","タバードL"};
	public int[][] armorValue = {		/*防具リスト　防具名　防具ポイント　買値　A戦士装備可能　B戦士装備可能　C魔術師装備可能　D戦士装備可能*/
		{1,5,0,1,0,0},			/*B戦士装備可能*/
		{1,5,0,0,0,1},			/*D戦士装備可能*/
		{1,5,1,0,0,0},			/*プレイヤー装備可能*/	
		{2,30,0,1,0,0},			/*B戦士装備可能*/
		{2,30,0,0,0,1},			/*D戦士装備可能*/
		{2,30,1,0,0,0},			/*プレイヤー装備可能*/
		{4,100,0,0,0,1},		/*D戦士装備可能*/
		{4,100,1,0,0,0},		/*プレイヤー装備可能*/
		{6,200,0,1,0,0},		/*B戦士装備可能*/
		{6,200,0,0,0,1},		/*D戦士装備可能*/
		{6,200,1,0,0,0}			/*プレイヤー装備可能*/
	};

}